import Cocoa

// 산술연산자-----------------------------
var x = 15, y = 7

print("\(x) + \(y) = \(x+y)")
print("\(x) - \(y) = \(x-y)")
print("\(x) * \(y) = \(x*y)")
print("\(x) / \(y) = \(x/y)")
print("\(x) % \(y) = \(x%y)") // 소숫점이 붙으면 안된다

var a = "sha", b = "LOVE"
print("\(a) + \(b) = \(a+b)") // 문자열은 합치기만 가능

// var c = true, d = false // bull의 경우 연산 불가

print(3+4*5) // 산수와 똑같음
print((3+4)*5)

// 비교연산자------------------------------
x = 10
y = 20

print("\(x) > \(y) = \(x>y)")
print("\(x) < \(y) = \(x<y)")
print("\(x) == \(y) = \(x == y)")
print("\(x) >= \(y) = \(x >= y)")
print("\(x) <= \(y) = \(x <= y)")
print("\(x) != \(y) = \(x != y)")

x = 20
y = 20

print("\(x) > \(y) = \(x>y)")
print("\(x) < \(y) = \(x<y)")
print("\(x) == \(y) = \(x == y)")
print("\(x) >= \(y) = \(x >= y)")
print("\(x) <= \(y) = \(x <= y)")
print("\(x) != \(y) = \(x != y)")

var x2 = "가간" , y2 = "가가"
// 다른 자료끼리는 연산 불가
/*
 print("\(x2) > \(y) = \(x2>y)")
print("\(x2) < \(y) = \(x2<y)")
print("\(x2) == \(y) = \(x2 == y)")
print("\(x2) >= \(y) = \(x2 >= y)")
print("\(x2) <= \(y) = \(x2 <= y)")
print("\(x2) != \(y) = \(x2 != y)")
*/
print("\(x2) > \(y2) = \(x2>y2)")
print("\(x2) < \(y2) = \(x2<y2)")
print("\(x2) == \(y2) = \(x2 == y2)")
print("\(x2) >= \(y2) = \(x2 >= y2)")
print("\(x2) <= \(y2) = \(x2 <= y2)")
print("\(x2) != \(y2) = \(x2 != y2)")
// 문자끼리 비교 가능 --> 알파벳 순서를 수치화하여 비교 a가 작고 z가 큼

var x3 = true, y3 = true
//print("\(x3) > \(y3) = \(x3>y3)")
//print("\(x3) < \(y3) = \(x3<y3)")
print("\(x3) == \(y3) = \(x3 == y3)")
//print("\(x3) >= \(y3) = \(x3 >= y3)")
//print("\(x3) <= \(y3) = \(x3 <= y3)")
print("\(x3) != \(y3) = \(x3 != y3)") // 같다 다르다만 가능

print("\(x) != \(y) = \(x > y + 20)") // 비교연산자보다 산술연산자가 우선임

// 논리연산자-----------------------------
print("\(x3) && \(y3) = \(x3 && y3)")
print("\(x3) || \(y3) = \(x3 || y3)")
print("!\(x3) = \(!x3)")

x3 = false
y3 = false
print("\(x3) && \(y3) = \(x3 && y3)")
print("\(x3) || \(y3) = \(x3 || y3)")
print("!\(x3) = \(!x3)")

//활용법
let age = 20
let color = "green"

/*
let ageChk = age <= 25
let ccChk = color == "red"

print("And : \(ageChk && ccChk)")
print("Or : \(ageChk || ccChk)")
*/

print("And : \(age <= 25 && color == "red")")
print("Or : \(age <= 25 || color <= "green")")
// 논리연산자와 비교연산자를 함께 사용 가능
// 논리연산자가 비교연산자보다 먼저

// 복합 할당 연산자-------------------------------
x = 10

x = x + 5

print("x = x + 5 :  \(x)")

x += 4
print("x += 5 :  \(x)")
x -= 4
print("x -= 5 :  \(x)")
x *= 4
print("x *= 5 :  \(x)")
x /= 2
print("x /= 2 :  \(x)")
x %= 4
print("x %= 5 :  \(x)")


// 조건(삼항)연산자-------------------------------------

print(true ? "참" : "거짓")
print(false ? "참" : "거짓")

x = 78
var res = x >= 70 ? "합격" : "불합격"
print("\(x) : \(res)")

res = x >= 80 ? "우수" :
     x >= 60 ? "양호" :
     x >= 40 ? "정상" : "미달"  // "" 는 모른다는 의미
print("\(x) : \(res)")

/*
 res = x >= 60 ? "우수" :
      x >= 80 ? "양호" :
      x >= 40 ? "정상" : "미달"  // "" 는 모른다는 의미
 print("\(x) : \(res)")
 
 이런 경우 처음 나오는 참이 가장 우선 시 된다.
 즉 조건문은 단계법으로 작성해야함. 처음의 참이 가장 작은 범주로 하는 것이 오류나지 않을 확률이 높다.
 
 res = x >= 80 ? "양호" :
       x >= 60 ? "우수" :
       x >= 40 ? "정상" : "미달"  // "" 는 모른다는 의미
 print("\(x) : \(res)")
 이런 식으로
 */

